Ebiroll/artpi/projects/art_pi_gdbstub/applications/target/stm32h7_target.c
#if 0

#endif


#define KEY1 0x45670123
#define KEY2 0xCDEF89AB

#define OPTKEY1 0x08192A3B
#define OPTKEY2 0x4C5D6E7F




#define DBGMCU_IDCODE	0x5c001000
/* Access from processor address space.
 * Access via the APB-D is at 0xe00e1000 */
#define DBGMCU_IDC		(DBGMCU_IDCODE + 0)
#define DBGMCU_CR		(DBGMCU_IDCODE + 4)
#define DBGSLEEP_D1		(1 << 0)
#define DBGSTOP_D1		(1 << 1)
#define DBGSTBY_D1		(1 << 2)
#define DBGSTOP_D3		(1 << 7)
#define DBGSTBY_D3		(1 << 8)
#define D1DBGCKEN		(1 << 21)
#define D3DBGCKEN		(1 << 22)


#define BANK1_START 		0x08000000
#define NUM_SECTOR_PER_BANK 8
#define FLASH_SECTOR_SIZE 	0x20000
#define BANK2_START         0x08100000
enum ID_STM32H7 {
	ID_STM32H74x  = 0x450,      /* RM0433, RM0399 */
	ID_STM32H7Bx  = 0x480,      /* RM0455 */
	ID_STM32H72x  = 0x483,      /* RM0468 */
};

struct stm32h7_flash {
	struct target_flash f;
	enum align psize;
	uint32_t regbase;
};

struct stm32h7_priv_s {
	uint32_t dbg_cr;
};

static void stm32h7_add_flash(target *t,
                              uint32_t addr, size_t length, size_t blocksize)
{
	struct stm32h7_flash *sf = calloc(1, sizeof(*sf));
	struct target_flash *f;

	if (!sf) {			/* calloc failed: heap exhaustion */
		DEBUG_WARN("calloc: failed in %s\n", __func__);
		return;
	}

	f = &sf->f;
	f->start = addr;
	f->length = length;
	f->blocksize = blocksize;
	f->erase = stm32h7_flash_erase;
	f->write = stm32h7_flash_write;
	f->buf_size = 2048;
	f->erased = 0xff;
	sf->regbase = FPEC1_BASE;
	if (addr >= BANK2_START)
		sf->regbase = FPEC2_BASE;
	sf->psize = ALIGN_DWORD;
	target_add_flash(t, f);
}

static bool stm32h7_attach(target *t)
{
	if (!cortexm_attach(t))
		return false;
	/* If IWDG runs as HARDWARE watchdog (44.3.4) erase
	 * will be aborted by the Watchdog and erase fails!
	 * Setting IWDG_KR to 0xaaaa does not seem to help!*/
	uint32_t optsr = target_mem_read32(t, FPEC1_BASE + FLASH_OPTSR);
	if (!(optsr & FLASH_OPTSR_IWDG1_SW))
		tc_printf(t, "Hardware IWDG running. Expect failure. Set IWDG1_SW!");

	/* Free previously loaded memory map */
	target_mem_map_free(t);

	/* Add RAM to memory map */
	/* Table 7. Memory map and default device memory area attributes RM 0433, pg 130 */
	target_add_ram(t, 0x00000000, 0x10000); /* ITCM Ram,  64 k */
	target_add_ram(t, 0x20000000, 0x20000); /* DTCM Ram, 128 k */
	target_add_ram(t, 0x24000000, 0x80000); /* AXI Ram,  512 k */
	target_add_ram(t, 0x30000000, 0x20000); /* AHB SRAM1, 128 k */
	target_add_ram(t, 0x30020000, 0x20000); /* AHB SRAM2, 128 k */
	target_add_ram(t, 0x30040000, 0x08000); /* AHB SRAM3,  32 k */
	target_add_ram(t, 0x38000000, 0x10000); /* AHB SRAM4,  64 k */

	/* Add the flash to memory map. */
	stm32h7_add_flash(t, 0x8000000, 0x100000, FLASH_SECTOR_SIZE);
	stm32h7_add_flash(t, 0x8100000, 0x100000, FLASH_SECTOR_SIZE);
	return true;
}

static void stm32h7_detach(target *t)
{
	struct stm32h7_priv_s *ps = (struct stm32h7_priv_s*)t->target_storage;

	target_mem_write32(t, DBGMCU_CR, ps->dbg_cr);
	cortexm_detach(t);
}

bool stm32h7_probe(target *t)
{
	cortexm_probe(t);
	uint32_t idcode = t->idcode;
	if (idcode == ID_STM32H74x || idcode == ID_STM32H7Bx || idcode == ID_STM32H72x) {
		t->driver = stm32h7_driver_str;
		t->attach = stm32h7_attach;
		t->detach = stm32h7_detach;
		target_add_commands(t, stm32h7_cmd_list, stm32h7_driver_str);
		/* Save private storage */
		struct stm32h7_priv_s *priv_storage = calloc(1, sizeof(*priv_storage));
		priv_storage->dbg_cr = target_mem_read32(t, DBGMCU_CR);
		t->target_storage = (void*)priv_storage;
		/* RM0433 Rev 4 is not really clear, what bits are needed in DBGMCU_CR.
		 * Maybe more flags needed?
		 */
		uint32_t dbgmcu_cr = DBGSLEEP_D1 | D1DBGCKEN;
		target_mem_write32(t, DBGMCU_CR,  dbgmcu_cr);
		return true;
	}
	return false;
}

void h7_mem_read(target *t, void *dest, target_addr src,size_t len) {
   	//printf("esp32_mem_read %d\n",len);
	int * i = (int *) (src & (~3));

	// TODO: better address range check?
	if (src < 0x20000000 || src >= 0x60000000) {
		return;
	}

    int * dm = (int *) dest;
    *dm= *i >> ((src & 3) * 8);
}

void h7_mem_write(target *t, target_addr dest,const void *src, size_t len) {
  int * ip = (int *) (dest & (~3));
  int * sip = (int *) (dest & (~3));

  for(int i=0; i<len/4; i++) {
    ip[i] = sip[i];
  }
}

static bool h7_check_error(target *t)
{
	return false;
}

static void h7_priv_free(void *priv)
{
	free(priv);
}

static void h7_halt_request(target *t)
{
	target_mem_write32(t, CORTEXM_DHCSR, CORTEXM_DHCSR_DBGKEY |
												CORTEXM_DHCSR_C_HALT |
												CORTEXM_DHCSR_C_DEBUGEN);
}


//static bool adi_check_error(ADIv5_AP_s *a)
//{
//	return false;
//}



target *stm32h7_probe_with_controller(struct target_controller *controller)
{
	target *t;

	t = target_new();
	struct ADIv5_AP_s *priv = calloc(1, sizeof(*priv));
	// priv->error=adi_check_error;
	t->priv = priv;

	t->priv_free = h7_priv_free;
	t->check_error = h7_check_error;
	t->mem_read = h7_mem_read;
	t->mem_write = h7_mem_write;
	t->halt_request = h7_halt_request;

	// Force id for use with qemu
	t->idcode=0x450;

    t->driver = stm32h7_driver_str;

    target_check_error(t);
	stm32h7_probe(t);

	// Back to default
	t->mem_read = h7_mem_read;
	t->mem_write = h7_mem_write;
	t->regs_read=stm32h7_regs_read;

    target_attach(t,controller);

// Test
 asm volatile(
    "svc #0x10 \n"
    "nop \n");


}



static bool stm32h7_flash_unlock(target *t, uint32_t addr)
{
	uint32_t regbase = FPEC1_BASE;
	if (addr >= BANK2_START) {
		regbase = FPEC2_BASE;
	}

	while(target_mem_read32(t, regbase + FLASH_SR) & FLASH_SR_BSY) {
		if(target_check_error(t))
			return false;
	}
	uint32_t sr = target_mem_read32(t, regbase + FLASH_SR) & FLASH_SR_ERROR_MASK;
	if (sr) {
		DEBUG_WARN("%s error 0x%08" PRIx32, __func__, sr);
		target_mem_write32(t, regbase + FLASH_CCR, sr);
		return false;
	}
	if (target_mem_read32(t, regbase + FLASH_CR) & FLASH_CR_LOCK) {
		/* Enable FLASH controller access */
		target_mem_write32(t, regbase + FLASH_KEYR, KEY1);
		target_mem_write32(t, regbase + FLASH_KEYR, KEY2);
	}
	if (target_mem_read32(t, regbase + FLASH_CR) & FLASH_CR_LOCK)
		return false;
	else
		return true;
}

static int stm32h7_flash_erase(struct target_flash *f, target_addr addr,
							   size_t len)
{
	target *t = f->t;
	struct stm32h7_flash *sf = (struct stm32h7_flash *)f;
	if (stm32h7_flash_unlock(t, addr) == false)
		return -1;
	/* We come out of reset with HSI 64 MHz. Adapt FLASH_ACR.*/
	target_mem_write32(t, sf->regbase + FLASH_ACR, 0);
	addr &= (NUM_SECTOR_PER_BANK * FLASH_SECTOR_SIZE) - 1;
	int start_sector =  addr / FLASH_SECTOR_SIZE;
	int end_sector   = (addr + len - 1) / FLASH_SECTOR_SIZE;

	enum align psize = ((struct stm32h7_flash *)f)->psize;
	uint32_t sr;
	while (start_sector <= end_sector) {
		uint32_t cr = (psize * FLASH_CR_PSIZE16) | FLASH_CR_SER |
			(start_sector * FLASH_CR_SNB_1);
		target_mem_write32(t, sf->regbase + FLASH_CR, cr);
		cr |= FLASH_CR_START;
		target_mem_write32(t, sf->regbase + FLASH_CR, cr);
		DEBUG_INFO(" started cr %08" PRIx32 " sr %08" PRIx32 "\n",
				   target_mem_read32(t, sf->regbase + FLASH_CR),
				   target_mem_read32(t, sf->regbase + FLASH_SR));
		do {
			sr = target_mem_read32(t, sf->regbase + FLASH_SR);
			if (target_check_error(t)) {
				DEBUG_WARN("stm32h7_flash_erase: comm failed\n");
				return -1;
			}
//			target_mem_write32(t, H7_IWDG_BASE, 0x0000aaaa);
		}while (sr & (FLASH_SR_QW | FLASH_SR_BSY));
		if (sr & FLASH_SR_ERROR_MASK) {
			DEBUG_WARN("stm32h7_flash_erase: error, sr: %08" PRIx32 "\n", sr);
			return -1;
		}
		start_sector++;
	}
	return 0;
}

static int stm32h7_flash_write(struct target_flash *f, target_addr dest,
                               const void *src, size_t len)
{
	target *t = f->t;
	struct stm32h7_flash *sf = (struct stm32h7_flash *)f;
	enum align psize = sf->psize;
	if (stm32h7_flash_unlock(t, dest) == false)
		return -1;
	uint32_t cr = psize * FLASH_CR_PSIZE16;
	target_mem_write32(t, sf->regbase + FLASH_CR, cr);
	cr |= FLASH_CR_PG;
	target_mem_write32(t, sf->regbase + FLASH_CR, cr);
	/* does H7 stall?*/
	uint32_t sr_reg = sf->regbase + FLASH_SR;
	uint32_t sr;
	target_mem_write(t, dest, src, len);
	while ((sr = target_mem_read32(t, sr_reg)) & FLASH_SR_BSY) {
		if(target_check_error(t)) {
			DEBUG_WARN("stm32h7_flash_write: BSY comm failed\n");
			return -1;
		}
	}
	if (sr & FLASH_SR_ERROR_MASK) {
		DEBUG_WARN("stm32h7_flash_write: error sr %08" PRIx32 "\n", sr);
		return -1;
	}
	/* Close write windows.*/
	target_mem_write32(t, sf->regbase + FLASH_CR, 0);
	return 0;
}

/* Both banks are erased in parallel.*/
static bool stm32h7_cmd_erase(target *t, int bank_mask)
{
	const char spinner[] = "|/-\\";
	int spinindex = 0;
	bool do_bank1 = bank_mask & 1, do_bank2 = bank_mask & 2;
	uint32_t cr;
	bool result = false;
	enum align psize = ALIGN_DWORD;
	for (struct target_flash *f = t->flash; f; f = f->next) {
		if (f->write == stm32h7_flash_write) {
			psize = ((struct stm32h7_flash *)f)->psize;
		}
	}
	cr = (psize * FLASH_CR_PSIZE16) | FLASH_CR_BER | FLASH_CR_START;
	/* Flash mass erase start instruction */
	if (do_bank1) {
		if (stm32h7_flash_unlock(t, BANK1_START) == false) {
			DEBUG_WARN("ME: Unlock bank1 failed\n");
			goto done;
		}
		uint32_t regbase = FPEC1_BASE;
		/* BER and start can be merged (3.3.10).*/
		target_mem_write32(t, regbase + FLASH_CR, cr);
		DEBUG_INFO("ME bank1 started\n");
	}
	if (do_bank2) {
		if (stm32h7_flash_unlock(t, BANK2_START) == false) {
			DEBUG_WARN("ME: Unlock bank2 failed\n");
			goto done;
		}
		uint32_t regbase = FPEC2_BASE;
		/* BER and start can be merged (3.3.10).*/
		target_mem_write32(t, regbase + FLASH_CR, cr);
		DEBUG_INFO("ME bank2 started\n");
	}

